// Дан список s, представляющий URL-адрес (буквы и пробелы). Нужно заменить все пробелы в первых k символах на %20 in-place, используя свободное место в конце списка, и вернуть изменённый список s.

// Пример 1:

// Ввод: s = ["h","e","l","l","o"," ","w","o","r","l","d","#","#"], k = 11
// Вывод: ["h","e","l","l","o","%","2","0","w","o","r","l","d"]
// Пример 2:

// Ввод: s = ["a"," ","b"," "," ","c","#","#","#","#","#","#"], k = 6
// Вывод: ["a","%","2","0","b","%","2","0","%","2","0","c"]

/**
 * @param {string[]} s
 * @param {number} k
 * @returns {string[]}
 */

// Паттерн:
export function urlify(s, k) {
  let fast = 0;
  let slow = 0;
  let spaces = 0;

  while (fast < k) {
    if (s[slow] === " ") {
      s.splice(slow, 1, "%", "2", "0").splice(slow, 1);
      slow += 3;
      spaces++;
    } else {
      slow++;
    }
    fast++;
  }

  s.splice(k + spaces * 2);

  return s;
}

console.log(
  urlify(["h", "e", "l", "l", "o", " ", "w", "o", "r", "l", "d", "#", "#"], 11),
);
